// Підключаємо необхідні бібліотеки
#include <iostream>
// Головна програма
int main(){
    // Даємо можливість користувачу обирати форму від 1 до 3
    int formChoice;
    std::cout << "Оберіть які форми будемо використовувати (від 1 до 3):\n1. Прямокутник\n2. Трикутник\n3. Коло";
    std::cin >> formChoice;
    // Якщо користувач обирав форму від 1 до 3, то
    if (formChoice >= 1 && formChoice <= 3){
        switch (formChoice){
        // Обрав прямокутник
        case 1:{
            std::cout << "Було обрано прямокутник!\n";
            // Ширина прямокутника
            int width;
            std::cout << "Напишіть значення ширини";
            std::cin >> width;
            // Висота прямокутника
            int height;
            std::cout << "Напишіть значення висоти";
            std::cin >> height;

            if (width > 0 && height > 0){
                // Формула площа прямокутника S=width*height
                std::cout << "Результат площи прямокутника: " << width*height << std::endl;
            }else{
                // Помилка якщо користувач написав число менше нуля
                std::cerr << "Виникла помилка! Число повинно бути більше нуля.";
            }
            break;}
        // Обрав трикутник
        case 2:{
            std::cout << "Було обрано трикутник!\n";
            // Довжина трикутника
            int length;
            std::cout << "Напишіть значення довжини";
            std::cin >> length;
            // Висота трикутника
            int height;
            std::cout << "Напишіть значення висоти";
            std::cin >> height;

            if (length > 0 && height > 0){
                // Формула площа трикутника S=(1/2)*length*height
                std::cout << "Результат площи трикутника: " << 0.5*length*height << std::endl;
            }else{
                // Помилка якщо користувач написав число менше нуля
                std::cerr << "Виникла помилка! Число повинно бути більше нуля.";
            }
            break;}
        // Обрав коло
        case 3:{
            std::cout << "Було обрано коло!\n";
            // Радіус кола
            int radius;
            std::cout << "Напишіть значення радіус";
            std::cin >> radius;

            if (radius > 0){
                // Формула площа кола S=2*π*radius
                std::cout << "Результат площи кола: " << 2*3.14*radius << std::endl;
            }else{
                // Помилка якщо користувач написав число менше нуля
                std::cerr << "Виникла помилка! Число повинно бути більше нуля.";
            }
            break;}
        }
    }// Але якщо користувач обрав варіант менше 1 або більше 3, то виникає помилка
    else{
        std::cerr << "Виникла помилка! Будь ласка введіть число правильно." << std::endl;
    }
    return 0;
}
