// Підключаємо необхідні бібліотеки
#include <iostream> // Зчитувати дані та їх типи
#include <vector> // Використовуємо для масиву
// Головна програма
int main() {
    int monthNumber; // Створюємо змінну int для число місяця
    std::cout << "Введіть число місяця (від 1 до 12)"; // Пишемо користувачу, що потрібно зробити
    std::cin >> monthNumber; // Даємо можливість користувачу написати дані
    // Масива з місяцями
    std::vector<std::string> months = {
        "січень", "лютий", "березень", "квітень",
        "травень", "червень", "липень", "серпень",
        "вересень", "жовтень", "листопад", "грудень"
    };
    // Оператори if та else 
    if (monthNumber >= 1 && monthNumber <= 12) { // Якщо нами виведені дані співпадають з цим випадком, то
        // Виводимо успішну відповідь в виді місяця, яку ми обрали
        std::cout << "Місяць, який ви вели це: " << months[monthNumber - 1] << std::endl;
    } else {
        // Але якщо ні, то виводимо помилку.
        std::cerr << "Виникла помилка! Будь ласка введіть число правильно." << std::endl;
    }
    return 0;
}
