#include <iostream>

int main() {
    // Задане число n, до якого потрібно генерувати послідовність та її ліміт.
    int limit;
    int a = 0, b = 1;

    // Даємо можливість користувачі написати число для виведення послідовності Фібоначчі
    std::cout << "Введіть число, до якого потрібно вивести послідовність Фібоначчі: ";
    std::cin >> limit;

    // Якщо число є від'ємним, то виникає помилка.
    if (limit < 0) {
        std::cerr << "Виникла помилка! Число має бути додатним." << std::endl;
        return 1;
    }

    // Цикл для генерації та виведення чисел, поки вони не перевищать limit
    std::cout << "Послідовність Фібоначчі до " << limit << ": ";
    if (limit >= 0) {
        std::cout << a;
    }
    while (b <= limit) {
        std::cout << ", " << b;
        int nextTerm = a + b;
        a = b;
        b = nextTerm;
    }

    // Закінчуємо код та закриваємо програму
    std::cout << std::endl;
    return 0;
}